#+TITLE: settings
#+AUTHOR: taimore khan
#+PROPERTY: header-args :results silent

** color
changes the color of text when typing hex to the color it is
#0000FF
#+begin_src emacs-lisp
(use-package rainbow-mode
  :hook
  (prog-mode . rainbow-mode)
  :custom
  (rainbow-x-colors nil))
#+end_src

#+RESULTS:
| rainbow-mode | rainbow-delimiters-mode | display-line-numbers-mode |

** indentation
#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :hook
  (python-mode . highlight-indent-guides-mode)
  (scss-mode . highlight-indent-guides-mode)
  :custom
  (highlight-indent-guides-method 'character))
#+end_src

#+RESULTS:
| highlight-indent-guides-mode |

